web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_2Day_AM_v12.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/ship/v12">
   <soapenv:Header/>
   <soapenv:Body>
      <v12:ProcessShipmentRequest>
         <v12:WebAuthenticationDetail>
            <v12:UserCredential>
               <v12:Key></v12:Key>
               <v12:Password/>
            </v12:UserCredential>
         </v12:WebAuthenticationDetail>
         <v12:ClientDetail>
            <v12:AccountNumber></v12:AccountNumber>
            <v12:MeterNumber></v12:MeterNumber>
         </v12:ClientDetail>
         <v12:TransactionDetail>
            <v12:CustomerTransactionId>ship_v12</v12:CustomerTransactionId>
         </v12:TransactionDetail>
         <v12:Version>
            <v12:ServiceId>ship</v12:ServiceId>
            <v12:Major>12</v12:Major>
            <v12:Intermediate>1</v12:Intermediate>
            <v12:Minor>0</v12:Minor>
         </v12:Version>
         <v12:RequestedShipment>
            <v12:ShipTimestamp>2012-08-16T09:30:47-05:00</v12:ShipTimestamp>
            <v12:DropoffType>REGULAR_PICKUP</v12:DropoffType>
            <v12:ServiceType>FEDEX_2_DAY_AM</v12:ServiceType>
            <v12:PackagingType>YOUR_PACKAGING</v12:PackagingType>
            <v12:TotalWeight>
               <v12:Units>LB</v12:Units>
               <v12:Value>50.0</v12:Value>
            </v12:TotalWeight>
            <v12:Shipper>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Contact>
                  <v12:CompanyName>FedEx-WAPI</v12:CompanyName>
                  <v12:PhoneNumber>1234567890</v12:PhoneNumber>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>SN2000 Test Meter 8</v12:StreetLines>
                  <v12:City>Texas</v12:City>
                  <v12:StateOrProvinceCode>TX</v12:StateOrProvinceCode>
                  <v12:PostalCode>73301</v12:PostalCode>
                  <v12:CountryCode>US</v12:CountryCode>
               </v12:Address>
            </v12:Shipper>
            <v12:Recipient>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Contact>
                  <v12:PersonName>Recipient Contact</v12:PersonName>
                  <v12:PhoneNumber>7894561230</v12:PhoneNumber>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>Recipient Address Line 1</v12:StreetLines>
                  <v12:City>Auburn</v12:City>
                  <v12:StateOrProvinceCode>NH</v12:StateOrProvinceCode>
                  <v12:PostalCode>03032</v12:PostalCode>
                  <v12:CountryCode>US</v12:CountryCode>
               </v12:Address>
            </v12:Recipient>
           <v12:ShippingChargesPayment>
               <v12:PaymentType>SENDER</v12:PaymentType>
               <v12:Payor>
                  <v12:ResponsibleParty>
                     <v12:AccountNumber></v12:AccountNumber>
                     <v12:Contact>
                        <v12:ContactId>RBB1057</v12:ContactId>
                        <v12:PersonName>ROHIT BORSE</v12:PersonName>
                        <v12:Title>Mr.</v12:Title>
                        <v12:CompanyName>DEOYAROHIT0705$</v12:CompanyName>
                        <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                        <v12:PhoneExtension>02033469</v12:PhoneExtension>
                        <v12:PagerNumber>9762308621</v12:PagerNumber>
                        <v12:FaxNumber>9762308621</v12:FaxNumber>
                        <v12:EMailAddress>Rohit*Borse@DeoyaRohit.com</v12:EMailAddress>
                     </v12:Contact>
                     <v12:Address>
                        <v12:StreetLines>SHIPPER ADDRESS LINE 1</v12:StreetLines>
                        <v12:StreetLines>SHIPPER ADDRESS LINE 2</v12:StreetLines>
                        <v12:City>HARRISON</v12:City>
                        <v12:StateOrProvinceCode>AR</v12:StateOrProvinceCode>
                        <v12:PostalCode>72601</v12:PostalCode>
                        <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                        <v12:CountryCode>US</v12:CountryCode>
                        <v12:Residential>0</v12:Residential>
                     </v12:Address>
                  </v12:ResponsibleParty>
               </v12:Payor>
            </v12:ShippingChargesPayment>
            <v12:LabelSpecification>
               <v12:LabelFormatType>COMMON2D</v12:LabelFormatType>
               <v12:ImageType>PNG</v12:ImageType>
               <v12:LabelStockType>PAPER_4X6</v12:LabelStockType>
            </v12:LabelSpecification>
            <v12:RateRequestTypes>ACCOUNT</v12:RateRequestTypes>
            <v12:PackageCount>1</v12:PackageCount>
            <v12:RequestedPackageLineItems>
               <v12:SequenceNumber>1</v12:SequenceNumber>
               <v12:GroupNumber>1</v12:GroupNumber>
               <v12:GroupPackageCount>1</v12:GroupPackageCount>
               <v12:Weight>
                  <v12:Units>LB</v12:Units>
                  <v12:Value>20.0</v12:Value>
               </v12:Weight>
               <v12:Dimensions>
                  <v12:Length>12</v12:Length>
                  <v12:Width>12</v12:Width>
                  <v12:Height>12</v12:Height>
                  <v12:Units>IN</v12:Units>
               </v12:Dimensions>
               <v12:ContentRecords>
                  <v12:PartNumber>123445</v12:PartNumber>
                  <v12:ItemNumber>kjdjalsro1262739827</v12:ItemNumber>
                  <v12:ReceivedQuantity>12</v12:ReceivedQuantity>
                  <v12:Description>ContentDescription</v12:Description>
               </v12:ContentRecords>
            </v12:RequestedPackageLineItems>
         </v12:RequestedShipment>
      </v12:ProcessShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>